In [1]:
# imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# create connection to database
connection = 'mysql+pymysql://root:root@localhost/movies'
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [3]:
# check if database exists
if database_exists(connection):
    print('Database Exists')
else:
    create_database(connection)
    print('Database Created')

Database Exists

In [4]:
# merging 2000/2001 csv into one
df2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
df2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')

In [5]:
df = pd.concat([df2000,df2001])
df_copy = df.copy()
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4454 entries, 0 to 2260
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                4454 non-null   object
 1   adult                  4452 non-null   float64
 2   backdrop_path          1940 non-null   object
 3   belongs_to_collection  247 non-null    object
 4   budget                 4452 non-null   float64
 5   genres                 4452 non-null   object
 6   homepage               230 non-null    object
 7   id                     4452 non-null   float64
 8   original_language      4452 non-null   object
 9   original_title         4452 non-null   object
 10  overview               4096 non-null   object
 11  popularity             4452 non-null   float64
 12  poster_path            3766 non-null   object
 13  production_companies   4452 non-null   object
 14  production_countries   4452 non-null   object
 15  release_date           4415 non-null   object
 16  revenue                4452 non-null   float64
 17  runtime                4452 non-null   float64
 18  spoken_languages       4452 non-null   object
 19  status                 4452 non-null   object
 20  tagline                1237 non-null   object
 21  title                  4452 non-null   object
 22  video                  4452 non-null   float64
 23  vote_average           4452 non-null   float64
 24  vote_count             4452 non-null   float64
 25  certification          821 non-null    object
dtypes: float64(9), object(17)
memory usage: 939.5+ KB

In [6]:
df_copy = df_copy[['imdb_id','revenue','budget','certification']]
df_copy.head()

     imdb_id  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN
2  tt0113092      0.0         0.0           NaN
3  tt0116391      0.0         0.0           NaN
4  tt0116748      0.0         0.0           NaN

In [7]:
basics = pd.read_csv('Data/title.basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [8]:
# creating column with genre list
basics['genres_split'] = basics['genres'].str.split(',')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [9]:
# create list of genres using explode
exploded_basics = basics.explode('genres_split')
exploded_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
144105,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
144106,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,Thriller
144107,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
144107,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
144108,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,Drama

In [10]:
# use for later
unique_genres = sorted(exploded_basics['genres_split'].unique())
len(unique_genres)

26

In [11]:
title_genre = exploded_basics[['tconst','genres_split']].copy()
title_genre.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [12]:
# creating genre mapper dictionary
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [13]:
title_genre['genre_id'] = title_genre['genres_split'].map(genre_id_map)
title_genre = title_genre.drop(columns='genres_split')
title_genre

           tconst  genre_id
0       tt0035423         5
0       tt0035423         9
0       tt0035423        18
1       tt0062336         7
2       tt0069049         7
...           ...       ...
144105  tt9916190        23
144106  tt9916270        23
144107  tt9916362         7
144107  tt9916362        11
144108  tt9916538         7

[249872 rows x 2 columns]

In [14]:
# creating genre map
lookup_genre = pd.DataFrame({'Genre_Name':genre_id_map.keys(),
                             'Genre_ID':genre_id_map.values()})
lookup_genre.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

**Saving SQL tables with tconst as Primary Key**

In [15]:
ratings = pd.read_csv('Data/title.ratings.tsv.gz')
ratings.to_sql('title_ratings', engine, if_exists='replace', index=False)

1237493

In [16]:
title_genre.to_sql('title_genres', engine, if_exists='replace', index=False)

249872

In [24]:
lookup_genre.to_sql('genres', engine, if_exists='replace', index=False)

26

In [26]:
df_copy.to_sql('tmdb_data', engine, if_exists='replace', index=False)

4454

In [17]:
# drop genres & genres_split from df
basics.drop(columns=['genres','genres_split'], inplace=True)

In [18]:
# getting max string length for tconst & PrimaryTitle
tconst_max_str = basics['tconst'].fillna('').map(len).max()
title_max_str = basics['primaryTitle'].fillna('').map(len).max()

from sqlalchemy.types import *
# calculating max string lengths
df_schema = {
    "tconst": String(tconst_max_str+1),
    "primaryTitle": Text(title_max_str+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [19]:
# saving to SQL with Dtype & index=False
basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False)

144109

In [20]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [27]:
q = '''
SHOW TABLES
FROM movies
'''
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data